{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "input_x"}, "inbound_nodes": []}, {"name": "embedding_layer", "class_name": "Embedding", "config": {"name": "embedding_layer", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 20177, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["input_x", 0, 0, {}]]]}, {"name": "bidirectional_layer", "class_name": "Bidirectional", "config": {"name": "bidirectional_layer", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_layer", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.8, "recurrent_dropout": 0.8, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_layer", 0, 0, {}]]]}, {"name": "babelnet", "class_name": "TimeDistributed", "config": {"name": "babelnet", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "babelnet_dense", "trainable": true, "dtype": "float32", "units": 117655, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["bidirectional_layer", 0, 0, {}]]]}, {"name": "domains", "class_name": "TimeDistributed", "config": {"name": "domains", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "domains_dense", "trainable": true, "dtype": "float32", "units": 1455, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["bidirectional_layer", 0, 0, {}]]]}, {"name": "lexnames", "class_name": "TimeDistributed", "config": {"name": "lexnames", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "lexnames_dense", "trainable": true, "dtype": "float32", "units": 47, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["bidirectional_layer", 0, 0, {}]]]}], "input_layers": [["input_x", 0, 0]], "output_layers": [["babelnet", 0, 0], ["domains", 0, 0], ["lexnames", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}